finance_choice_filter_query = ['flow2021', 'flow2022', 'flow2023', 'flow2024', 'TaxMode']

taxmode_arg_list = [
    'osno', 'ysn1', 'ysn3', 'ysn4', 'ysn6', 'ysn7', 'ysn10', 'ysn15', 'ysn15', 'aysn'
]

taxmode_arg_dict = {
    'osno': 'ОСНО',
    'ysn1': 'УСН 1%',
    'ysn3': 'УСН 3%',
    'ysn4': 'УСН 4%',
    'ysn6': 'УСН 6%',
    'ysn7': 'УСН 7%',
    'ysn10': 'УСН 10%',
    'ysn15': 'УСН 15%',
    'aysn': 'АУСН'
}

finance_arg_list = [
    'obor0', 'obor1', 'obor1_3', 'obor3_5',
    'obor5_10', 'obor10_20', 'obor20_50',
    'obor50_100', 'obor100_250', 'obor250_500',
    'obor500_1000', 'obormldr', 'obormoremldr'
]

finance_arg_dict = {
    'obor0': 'Без оборотов',
    'obor1': '< 1 млн. руб.',
    'obor1_3': '> 1 млн. руб.',
    'obor3_5': '> 3 млн. руб.',
    'obor5_10': '> 5 млн. руб.',
    'obor10_20': '> 10 млн. руб.',
    'obor20_50': '> 15 млн. руб.',
    'obor50_100': '> 20 млн. руб.',
    'obor100_250': '> 50 млн. руб.',
    'obor250_500': '> 100 млн. руб.',
    'obor500_1000': '> 250 млн. руб.',
    'obormldr': '> 500 млн. руб.',
    'obormoremldr': '> 1 млрд. руб.'
}

finance_flow_str_list = ['Без оборотов', 
                         '< 1 млн. руб.', 
                         '> 1 млн. руб.', 
                         '> 3 млн. руб.', 
                         '> 5 млн. руб.', 
                         '> 10 млн. руб.',  
                         '> 15 млн. руб.', 
                         '> 20 млн. руб.',
                         '> 50 млн. руб.',
                         '> 100 млн. руб.',
                         '> 250 млн. руб.',
                         '> 500 млн. руб.',
                         '> 1 млрд. руб.']